app/controllers/banks_controller.rb

SELECT COUNT(*) FROM "BANKS" WHERE "BANKS"."APPROVAL_STATUS" = :a1  [["approval_status", "A"]]
SELECT "BANKS".* FROM "BANKS" WHERE "BANKS"."APPROVAL_STATUS" = :a1 ORDER BY id desc OFFSET :a2 ROWS FETCH FIRST :a3 ROWS ONLY  [["approval_status", "A"], ["OFFSET", 0], ["LIMIT", 10]]
---
  def index
    banks = (params[:approval_status].present? and params[:approval_status] == 'U') ? Bank.unscoped.where("approval_status =?",'U').order("id desc") : Bank.order("id desc")
    @banks_count = banks.count
    @banks = banks.paginate(:per_page => 10, :page => params[:page]) rescue []