app/controllers/ft_purpose_codes_controller.rb

  def index
    if params[:advanced_search].present?
      ft_purpose_codes = find_ft_purpose_codes(params).order("id desc")
    else
      ft_purpose_codes = (params[:approval_status].present? and params[:approval_status] == 'U') ? FtPurposeCode.unscoped.where("approval_status =?",'U').order("id desc") : FtPurposeCode.order("id desc")
    end
    @ft_purpose_codes_count = ft_purpose_codes.count
    @ft_purpose_codes = ft_purpose_codes.paginate(:per_page => 10, :page => params[:page]) rescue []
---
SELECT COUNT(*) FROM "FT_PURPOSE_CODES" WHERE "FT_PURPOSE_CODES"."APPROVAL_STATUS" = :a1  [["approval_status", "A"]]
SELECT "FT_PURPOSE_CODES".* FROM "FT_PURPOSE_CODES" WHERE "FT_PURPOSE_CODES"."APPROVAL_STATUS" = :a1 ORDER BY id desc OFFSET :a2 ROWS FETCH FIRST :a3 ROWS ONLY  [["approval_status", "A"], ["OFFSET", 0], ["LIMIT", 10]]