app/controllers/inw_guidelines_controller.rb

SELECT COUNT(*) FROM "INW_GUIDELINES" WHERE "INW_GUIDELINES"."APPROVAL_STATUS" = :a1  [["approval_status", "A"]]
SELECT "INW_GUIDELINES".* FROM "INW_GUIDELINES" WHERE "INW_GUIDELINES"."APPROVAL_STATUS" = :a1 ORDER BY id desc OFFSET :a2 ROWS FETCH FIRST :a3 ROWS ONLY  [["approval_status", "A"], ["OFFSET", 0], ["LIMIT", 10]]
---
  def index
    if params[:advanced_search].present?
      inw_guidelines = find_inw_guidelines(params).order("id desc")
    else
      inw_guidelines = (params[:approval_status].present? and params[:approval_status] == 'U') ? InwGuideline.unscoped.where("approval_status =?",'U').order("id desc") : InwGuideline.order("id desc")
    end
    @inw_guidelines_count = inw_guidelines.count
    @inw_guidelines = inw_guidelines.paginate(:per_page => 10, :page => params[:page]) rescue []