app/controllers/inward_remittances_controller.rb

SELECT COUNT(*) FROM "INWARD_REMITTANCES"
SELECT "INWARD_REMITTANCES".* FROM "INWARD_REMITTANCES" ORDER BY id desc OFFSET :a1 ROWS FETCH FIRST :a2 ROWS ONLY  [["OFFSET", 0], ["LIMIT", 10]]
---
  def index
    inward_remittances = InwardRemittance.order("id desc")
    if params[:advanced_search].present?
      inward_remittances = find_inward_remittances(params).order("id desc")
    else
      if params[:req_no]
        inward_remittances = inward_remittances.where(:req_no => params[:req_no])
      else
        maxQuery = InwardRemittance.select("max(attempt_no) as attempt_no,req_no").group(:req_no)
        inward_remittances = InwardRemittance.joins("inner join (#{maxQuery.to_sql}) a on a.req_no=inward_remittances.req_no and a.attempt_no=inward_remittances.attempt_no")
      end
    end
    @inward_remittances_count = inward_remittances.count
    @inward_remittances = inward_remittances.paginate(:per_page => 10, :page => params[:page]) rescue []