app/controllers/partners_controller.rb

  def index
    if params[:advanced_search].present?
      partners = find_partners(params).order("id desc")
    else
      partners = (params[:approval_status].present? and params[:approval_status] == 'U') ? Partner.unscoped.where("approval_status =?",'U').order("id desc") : Partner.order("id desc")
    end
    @partners_count = partners.count
    @partners = partners.paginate(:per_page => 10, :page => params[:page]) rescue []
---
SELECT COUNT(*) FROM "PARTNERS" WHERE "PARTNERS"."APPROVAL_STATUS" = :a1  [["approval_status", "A"]]
SELECT "PARTNERS".* FROM "PARTNERS" WHERE "PARTNERS"."APPROVAL_STATUS" = :a1 ORDER BY id desc OFFSET :a2 ROWS FETCH FIRST :a3 ROWS ONLY  [["approval_status", "A"], ["OFFSET", 0], ["LIMIT", 10]]