app/controllers/partner_lcy_rates_controller.rb

  def index
    if params[:advanced_search].present?
      partner_lcy_rates = find_partner_lcy_rates(params).order("id desc")
    else
      partner_lcy_rates = (params[:approval_status].present? and params[:approval_status] == 'U') ? PartnerLcyRate.unscoped.where("approval_status =?",'U').order("id desc") : PartnerLcyRate.order("id desc")
    end
    @partner_lcy_rates_count = partner_lcy_rates.count
    @partner_lcy_rates = partner_lcy_rates.paginate(:per_page => 10, :page => params[:page]) rescue []
---
SELECT COUNT(*) FROM "PARTNER_LCY_RATES" WHERE "PARTNER_LCY_RATES"."APPROVAL_STATUS" = :a1  [["approval_status", "A"]]
SELECT "PARTNER_LCY_RATES".* FROM "PARTNER_LCY_RATES" WHERE "PARTNER_LCY_RATES"."APPROVAL_STATUS" = :a1 ORDER BY id desc OFFSET :a2 ROWS FETCH FIRST :a3 ROWS ONLY  [["approval_status", "A"], ["OFFSET", 0], ["LIMIT", 10]]