app/controllers/purpose_codes_controller.rb

  def index
    if params[:advanced_search].present?
      purpose_codes = find_purpose_codes(params).order("id desc")
    else
      purpose_codes = (params[:approval_status].present? and params[:approval_status] == 'U') ? PurposeCode.unscoped.where("approval_status =?",'U').order("id desc") : PurposeCode.order("id desc")
    end
    @purpose_codes_count = purpose_codes.count
    @purpose_codes = purpose_codes.paginate(:per_page => 10, :page => params[:page]) rescue []
---
SELECT COUNT(*) FROM "PURPOSE_CODES" WHERE "PURPOSE_CODES"."APPROVAL_STATUS" = :a1  [["approval_status", "A"]]
SELECT "PURPOSE_CODES".* FROM "PURPOSE_CODES" WHERE "PURPOSE_CODES"."APPROVAL_STATUS" = :a1 ORDER BY id desc OFFSET :a2 ROWS FETCH FIRST :a3 ROWS ONLY  [["approval_status", "A"], ["OFFSET", 0], ["LIMIT", 10]]