app/controllers/whitelisted_identities_controller.rb

  def index
    if params[:advanced_search].present?
      whitelisted_identities = find_identities(params).order("whitelisted_identities.id desc")
    else
      whitelisted_identities = (params[:approval_status].present? and params[:approval_status] == 'U') ? WhitelistedIdentity.unscoped.where("approval_status =?",'U').order("whitelisted_identities.id desc") : WhitelistedIdentity.order("whitelisted_identities.id desc")
    end
    @whitelisted_identities_count = whitelisted_identities.count
    @whitelisted_identities = whitelisted_identities.paginate(:per_page => 10, :page => params[:page]) rescue []
---
SELECT COUNT(*) FROM "WHITELISTED_IDENTITIES" WHERE "WHITELISTED_IDENTITIES"."APPROVAL_STATUS" = :a1  [["approval_status", "A"]]
SELECT "WHITELISTED_IDENTITIES".* FROM "WHITELISTED_IDENTITIES" WHERE "WHITELISTED_IDENTITIES"."APPROVAL_STATUS" = :a1 ORDER BY id desc OFFSET :a2 ROWS FETCH FIRST :a3 ROWS ONLY  [["approval_status", "A"], ["OFFSET", 0], ["LIMIT", 10]]